In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [3]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])
s

0     1
1     3
2     5
3   NaN
4     6
5     8
dtype: float64

In [4]:
type(s)

pandas.core.series.Series

Creating a DataFrame by passing a numpy array, with a datetime index and labeled columns

In [5]:
dates = pd.date_range('20130101', periods=6)
dates

<class 'pandas.tseries.index.DatetimeIndex'>
[2013-01-01, ..., 2013-01-06]
Length: 6, Freq: D, Timezone: None

In [6]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01  0.599473 -0.356687 -1.274829  0.551027
2013-01-02  1.223142 -0.093306  0.426288  1.850803
2013-01-03 -0.246529  1.722214  0.056863 -1.174623
2013-01-04 -0.736053 -0.902892  1.818953  1.410067
2013-01-05 -2.126120 -0.296749 -1.253166 -0.021765
2013-01-06  0.800072 -0.232568  1.490490  0.035192

In [7]:
df2 = pd.DataFrame({'A': 1.,
                    'B': pd.Timestamp('20130102'),
                    'C': pd.Series(1, index=list(range(4)), dtype='float32'),
                    'D': np.array([3]*4, dtype='int32'),
                    'E': pd.Categorical(["test", "train", "test", "train"]),
                    'F': 'foo'})
df2

   A          B  C  D      E    F
0  1 2013-01-02  1  3   test  foo
1  1 2013-01-02  1  3  train  foo
2  1 2013-01-02  1  3   test  foo
3  1 2013-01-02  1  3  train  foo

In [8]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [9]:
df.head()

                   A         B         C         D
2013-01-01  0.599473 -0.356687 -1.274829  0.551027
2013-01-02  1.223142 -0.093306  0.426288  1.850803
2013-01-03 -0.246529  1.722214  0.056863 -1.174623
2013-01-04 -0.736053 -0.902892  1.818953  1.410067
2013-01-05 -2.126120 -0.296749 -1.253166 -0.021765

In [10]:
df.tail(3)

                   A         B         C         D
2013-01-04 -0.736053 -0.902892  1.818953  1.410067
2013-01-05 -2.126120 -0.296749 -1.253166 -0.021765
2013-01-06  0.800072 -0.232568  1.490490  0.035192

In [11]:
df.index

<class 'pandas.tseries.index.DatetimeIndex'>
[2013-01-01, ..., 2013-01-06]
Length: 6, Freq: D, Timezone: None

In [12]:
df2.index

Int64Index([0, 1, 2, 3], dtype='int64')

In [13]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [14]:
df2.columns

Index(['A', 'B', 'C', 'D', 'E', 'F'], dtype='object')

In [15]:
df.values

array([[ 0.59947275, -0.35668749, -1.27482949,  0.55102739],
       [ 1.22314249, -0.09330643,  0.42628813,  1.85080298],
       [-0.24652851,  1.72221404,  0.05686321, -1.17462265],
       [-0.73605279, -0.90289216,  1.81895343,  1.41006658],
       [-2.12611953, -0.29674888, -1.25316647, -0.02176542],
       [ 0.80007166, -0.23256803,  1.49048956,  0.03519178]])

In [16]:
type(df.values)

numpy.ndarray

In [17]:
df.shape

(6, 4)

In [18]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.081002 -0.026665  0.210766  0.441783
std    1.231189  0.900561  1.314853  1.088835
min   -2.126120 -0.902892 -1.274829 -1.174623
25%   -0.613672 -0.341703 -0.925659 -0.007526
50%    0.176472 -0.264658  0.241576  0.293110
75%    0.749922 -0.128122  1.224439  1.195307
max    1.223142  1.722214  1.818953  1.850803

In [19]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.599473    1.223142   -0.246529   -0.736053   -2.126120    0.800072
B   -0.356687   -0.093306    1.722214   -0.902892   -0.296749   -0.232568
C   -1.274829    0.426288    0.056863    1.818953   -1.253166    1.490490
D    0.551027    1.850803   -1.174623    1.410067   -0.021765    0.035192

In [20]:
df.sort_index(axis=1, ascending = False)

                   D         C         B         A
2013-01-01  0.551027 -1.274829 -0.356687  0.599473
2013-01-02  1.850803  0.426288 -0.093306  1.223142
2013-01-03 -1.174623  0.056863  1.722214 -0.246529
2013-01-04  1.410067  1.818953 -0.902892 -0.736053
2013-01-05 -0.021765 -1.253166 -0.296749 -2.126120
2013-01-06  0.035192  1.490490 -0.232568  0.800072

In [21]:
df.sort(columns='A')

                   A         B         C         D
2013-01-05 -2.126120 -0.296749 -1.253166 -0.021765
2013-01-04 -0.736053 -0.902892  1.818953  1.410067
2013-01-03 -0.246529  1.722214  0.056863 -1.174623
2013-01-01  0.599473 -0.356687 -1.274829  0.551027
2013-01-06  0.800072 -0.232568  1.490490  0.035192
2013-01-02  1.223142 -0.093306  0.426288  1.850803

In [22]:
df['A']

2013-01-01    0.599473
2013-01-02    1.223142
2013-01-03   -0.246529
2013-01-04   -0.736053
2013-01-05   -2.126120
2013-01-06    0.800072
Freq: D, Name: A, dtype: float64

In [25]:
df[0:3]

                   A         B         C         D
2013-01-01  0.599473 -0.356687 -1.274829  0.551027
2013-01-02  1.223142 -0.093306  0.426288  1.850803
2013-01-03 -0.246529  1.722214  0.056863 -1.174623

In [26]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02  1.223142 -0.093306  0.426288  1.850803
2013-01-03 -0.246529  1.722214  0.056863 -1.174623
2013-01-04 -0.736053 -0.902892  1.818953  1.410067

In [36]:
df.loc[dates[0]]

A    0.599473
B   -0.356687
C   -1.274829
D    0.551027
Name: 2013-01-01 00:00:00, dtype: float64

In [39]:
df.loc[:, 'A':'C']

                   A         B         C
2013-01-01  0.599473 -0.356687 -1.274829
2013-01-02  1.223142 -0.093306  0.426288
2013-01-03 -0.246529  1.722214  0.056863
2013-01-04 -0.736053 -0.902892  1.818953
2013-01-05 -2.126120 -0.296749 -1.253166
2013-01-06  0.800072 -0.232568  1.490490

In [40]:
df.loc['20130102':'20130104', ['A', 'B']]

                   A         B
2013-01-02  1.223142 -0.093306
2013-01-03 -0.246529  1.722214
2013-01-04 -0.736053 -0.902892

In [41]:
df.loc['20130102', ['A', 'B']]

A    1.223142
B   -0.093306
Name: 2013-01-02 00:00:00, dtype: float64

In [78]:
df.loc[dates[0], 'A']

0.59947274622722635

In [79]:
df.at[dates[0], 'A']

0.59947274622722635

In [57]:
df

                   A         B         C         D
2013-01-01  0.599473 -0.356687 -1.274829  0.551027
2013-01-02  1.223142 -0.093306  0.426288  1.850803
2013-01-03 -0.246529  1.722214  0.056863 -1.174623
2013-01-04 -0.736053 -0.902892  1.818953  1.410067
2013-01-05 -2.126120 -0.296749 -1.253166 -0.021765
2013-01-06  0.800072 -0.232568  1.490490  0.035192

In [62]:
df.iloc[3]

A   -0.736053
B   -0.902892
C    1.818953
D    1.410067
Name: 2013-01-04 00:00:00, dtype: float64

In [63]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04 -0.736053 -0.902892
2013-01-05 -2.126120 -0.296749

In [71]:
df.iloc[[1, 2, 4], [0, 2]]

                   A         C
2013-01-02  1.223142  0.426288
2013-01-03 -0.246529  0.056863
2013-01-05 -2.126120 -1.253166

In [72]:
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02  1.223142 -0.093306  0.426288  1.850803
2013-01-03 -0.246529  1.722214  0.056863 -1.174623

In [73]:
df.iloc[:, 1:3]

                   B         C
2013-01-01 -0.356687 -1.274829
2013-01-02 -0.093306  0.426288
2013-01-03  1.722214  0.056863
2013-01-04 -0.902892  1.818953
2013-01-05 -0.296749 -1.253166
2013-01-06 -0.232568  1.490490

In [74]:
df.iloc[1,1]

-0.093306429283721348

In [75]:
df.iat[1,1]

-0.093306429283721348

## Boolean Indexing

In [80]:
df[df.A > 0]

                   A         B         C         D
2013-01-01  0.599473 -0.356687 -1.274829  0.551027
2013-01-02  1.223142 -0.093306  0.426288  1.850803
2013-01-06  0.800072 -0.232568  1.490490  0.035192

In [81]:
df[df > 0]

                   A         B         C         D
2013-01-01  0.599473       NaN       NaN  0.551027
2013-01-02  1.223142       NaN  0.426288  1.850803
2013-01-03       NaN  1.722214  0.056863       NaN
2013-01-04       NaN       NaN  1.818953  1.410067
2013-01-05       NaN       NaN       NaN       NaN
2013-01-06  0.800072       NaN  1.490490  0.035192

In [82]:
df[df < 0]

                   A         B         C         D
2013-01-01       NaN -0.356687 -1.274829       NaN
2013-01-02       NaN -0.093306       NaN       NaN
2013-01-03 -0.246529       NaN       NaN -1.174623
2013-01-04 -0.736053 -0.902892       NaN       NaN
2013-01-05 -2.126120 -0.296749 -1.253166 -0.021765
2013-01-06       NaN -0.232568       NaN       NaN

In [84]:
df3 = df.copy()
df3['E'] = ['one', 'one', 'two', 'three', 'four', 'three']
df3

                   A         B         C         D      E
2013-01-01  0.599473 -0.356687 -1.274829  0.551027    one
2013-01-02  1.223142 -0.093306  0.426288  1.850803    one
2013-01-03 -0.246529  1.722214  0.056863 -1.174623    two
2013-01-04 -0.736053 -0.902892  1.818953  1.410067  three
2013-01-05 -2.126120 -0.296749 -1.253166 -0.021765   four
2013-01-06  0.800072 -0.232568  1.490490  0.035192  three

In [89]:
filter = df3['E'].isin(['two', 'four'])
filter

2013-01-01    False
2013-01-02    False
2013-01-03     True
2013-01-04    False
2013-01-05     True
2013-01-06    False
Freq: D, Name: E, dtype: bool

In [90]:
filter.values

array([False, False,  True, False,  True, False], dtype=bool)

In [93]:
df3[filter]

                   A         B         C         D     E
2013-01-03 -0.246529  1.722214  0.056863 -1.174623   two
2013-01-05 -2.126120 -0.296749 -1.253166 -0.021765  four

In [94]:
df3['A'] *10

2013-01-01     5.994727
2013-01-02    12.231425
2013-01-03    -2.465285
2013-01-04    -7.360528
2013-01-05   -21.261195
2013-01-06     8.000717
Freq: D, Name: A, dtype: float64

# Setting

In [96]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range('20130102', periods=6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [102]:
df['F'] = s1
df

                   A         B         C         D   F
2013-01-01  0.599473 -0.356687 -1.274829  0.551027 NaN
2013-01-02  1.223142 -0.093306  0.426288  1.850803   1
2013-01-03 -0.246529  1.722214  0.056863 -1.174623   2
2013-01-04 -0.736053 -0.902892  1.818953  1.410067   3
2013-01-05 -2.126120 -0.296749 -1.253166 -0.021765   4
2013-01-06  0.800072 -0.232568  1.490490  0.035192   5

In [103]:
df.at[dates[0], 'A'] = 0
df

                   A         B         C         D   F
2013-01-01  0.000000 -0.356687 -1.274829  0.551027 NaN
2013-01-02  1.223142 -0.093306  0.426288  1.850803   1
2013-01-03 -0.246529  1.722214  0.056863 -1.174623   2
2013-01-04 -0.736053 -0.902892  1.818953  1.410067   3
2013-01-05 -2.126120 -0.296749 -1.253166 -0.021765   4
2013-01-06  0.800072 -0.232568  1.490490  0.035192   5

In [105]:
df.iat[1, 1] = 1
df

                   A         B         C         D   F
2013-01-01  0.000000 -0.356687 -1.274829  0.551027 NaN
2013-01-02  1.223142  1.000000  0.426288  1.850803   1
2013-01-03 -0.246529  1.722214  0.056863 -1.174623   2
2013-01-04 -0.736053 -0.902892  1.818953  1.410067   3
2013-01-05 -2.126120 -0.296749 -1.253166 -0.021765   4
2013-01-06  0.800072 -0.232568  1.490490  0.035192   5

In [106]:
df.loc[:, 'D'] = np.array([5] * len(df))
df

                   A         B         C  D   F
2013-01-01  0.000000 -0.356687 -1.274829  5 NaN
2013-01-02  1.223142  1.000000  0.426288  5   1
2013-01-03 -0.246529  1.722214  0.056863  5   2
2013-01-04 -0.736053 -0.902892  1.818953  5   3
2013-01-05 -2.126120 -0.296749 -1.253166  5   4
2013-01-06  0.800072 -0.232568  1.490490  5   5

In [108]:
df2 = df.copy()
df2[df2 > 0] = -df2
df2

                   A         B         C  D   F
2013-01-01  0.000000 -0.356687 -1.274829 -5 NaN
2013-01-02 -1.223142 -1.000000 -0.426288 -5  -1
2013-01-03 -0.246529 -1.722214 -0.056863 -5  -2
2013-01-04 -0.736053 -0.902892 -1.818953 -5  -3
2013-01-05 -2.126120 -0.296749 -1.253166 -5  -4
2013-01-06 -0.800072 -0.232568 -1.490490 -5  -5

In [112]:
df2['G'] = df2['D'] + df2['F']
df2

                   A         B         C  D   F   G
2013-01-01  0.000000 -0.356687 -1.274829 -5 NaN NaN
2013-01-02 -1.223142 -1.000000 -0.426288 -5  -1  -6
2013-01-03 -0.246529 -1.722214 -0.056863 -5  -2  -7
2013-01-04 -0.736053 -0.902892 -1.818953 -5  -3  -8
2013-01-05 -2.126120 -0.296749 -1.253166 -5  -4  -9
2013-01-06 -0.800072 -0.232568 -1.490490 -5  -5 -10

In [117]:
df2['H'] = df2['G'] - range(2, len(df)+2)
df2

                   A         B         C  D   F   G   H
2013-01-01  0.000000 -0.356687 -1.274829 -5 NaN NaN NaN
2013-01-02 -1.223142 -1.000000 -0.426288 -5  -1  -6  -9
2013-01-03 -0.246529 -1.722214 -0.056863 -5  -2  -7 -11
2013-01-04 -0.736053 -0.902892 -1.818953 -5  -3  -8 -13
2013-01-05 -2.126120 -0.296749 -1.253166 -5  -4  -9 -15
2013-01-06 -0.800072 -0.232568 -1.490490 -5  -5 -10 -17

In [119]:
(5) * 4

20

In [120]:
[5] * 4

[5, 5, 5, 5]

In [121]:
(5, 6) * 4

(5, 6, 5, 6, 5, 6, 5, 6)

In [136]:
a = {'one': 5, 'two': 10}
type(a)

dict

In [135]:
a.get('one')

5

In [140]:
a['one'] = 1
a

{'two': 10, 'one': 1}

## Missing Data

In [141]:
np.nan

nan

In [142]:
type(np.nan)

float

In [146]:
df

                   A         B         C  D   F
2013-01-01  0.000000 -0.356687 -1.274829  5 NaN
2013-01-02  1.223142  1.000000  0.426288  5   1
2013-01-03 -0.246529  1.722214  0.056863  5   2
2013-01-04 -0.736053 -0.902892  1.818953  5   3
2013-01-05 -2.126120 -0.296749 -1.253166  5   4
2013-01-06  0.800072 -0.232568  1.490490  5   5

In [176]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])
df1

                   A         B         C  D   F   E
2013-01-01  0.000000 -0.356687 -1.274829  5 NaN NaN
2013-01-02  1.223142  1.000000  0.426288  5   1 NaN
2013-01-03 -0.246529  1.722214  0.056863  5   2 NaN
2013-01-04 -0.736053 -0.902892  1.818953  5   3 NaN

In [178]:
df1.loc[dates[0]:dates[1], 'E'] = 1
df1

                   A         B         C  D   F   E
2013-01-01  0.000000 -0.356687 -1.274829  5 NaN   1
2013-01-02  1.223142  1.000000  0.426288  5   1   1
2013-01-03 -0.246529  1.722214  0.056863  5   2 NaN
2013-01-04 -0.736053 -0.902892  1.818953  5   3 NaN

In [179]:
df1.dropna()

                   A  B         C  D  F  E
2013-01-02  1.223142  1  0.426288  5  1  1

In [180]:
df1.fillna(value=5)

                   A         B         C  D  F  E
2013-01-01  0.000000 -0.356687 -1.274829  5  5  1
2013-01-02  1.223142  1.000000  0.426288  5  1  1
2013-01-03 -0.246529  1.722214  0.056863  5  2  5
2013-01-04 -0.736053 -0.902892  1.818953  5  3  5

In [181]:
df1.isnull()

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

In [182]:
df.mean()

A   -0.180914
B    0.155553
C    0.210766
D    5.000000
F    3.000000
dtype: float64

In [184]:
df.mean(1)

2013-01-01    0.842121
2013-01-02    1.729886
2013-01-03    1.706510
2013-01-04    1.636002
2013-01-05    1.064793
2013-01-06    2.411599
Freq: D, dtype: float64

In [187]:
s = pd.Series([1, 3, 5, np.nan, 6, 8], index=dates).shift(2)
s

2013-01-01   NaN
2013-01-02   NaN
2013-01-03     1
2013-01-04     3
2013-01-05     5
2013-01-06   NaN
Freq: D, dtype: float64

In [193]:
s.shift(-2)

2013-01-01     1
2013-01-02     3
2013-01-03     5
2013-01-04   NaN
2013-01-05   NaN
2013-01-06   NaN
Freq: D, dtype: float64

In [188]:
df

                   A         B         C  D   F
2013-01-01  0.000000 -0.356687 -1.274829  5 NaN
2013-01-02  1.223142  1.000000  0.426288  5   1
2013-01-03 -0.246529  1.722214  0.056863  5   2
2013-01-04 -0.736053 -0.902892  1.818953  5   3
2013-01-05 -2.126120 -0.296749 -1.253166  5   4
2013-01-06  0.800072 -0.232568  1.490490  5   5

In [196]:
df.sub(s, axis='index')

                   A         B         C   D   F
2013-01-01       NaN       NaN       NaN NaN NaN
2013-01-02       NaN       NaN       NaN NaN NaN
2013-01-03 -1.246529  0.722214 -0.943137   4   1
2013-01-04 -3.736053 -3.902892 -1.181047   2   0
2013-01-05 -7.126120 -5.296749 -6.253166   0  -1
2013-01-06       NaN       NaN       NaN NaN NaN

In [197]:
df.apply(np.cumsum)

                   A         B         C   D   F
2013-01-01  0.000000 -0.356687 -1.274829   5 NaN
2013-01-02  1.223142  0.643313 -0.848541  10   1
2013-01-03  0.976614  2.365527 -0.791678  15   3
2013-01-04  0.240561  1.462634  1.027275  20   6
2013-01-05 -1.885558  1.165885 -0.225891  25  10
2013-01-06 -1.085487  0.933317  1.264598  30  15

In [198]:
df.apply(lambda x: x.max() - x.min())

A    3.349262
B    2.625106
C    3.093783
D    0.000000
F    4.000000
dtype: float64

In [206]:
df

                   A         B         C  D   F
2013-01-01  0.000000 -0.356687 -1.274829  5 NaN
2013-01-02  1.223142  1.000000  0.426288  5   1
2013-01-03 -0.246529  1.722214  0.056863  5   2
2013-01-04 -0.736053 -0.902892  1.818953  5   3
2013-01-05 -2.126120 -0.296749 -1.253166  5   4
2013-01-06  0.800072 -0.232568  1.490490  5   5

In [208]:
df - df.shift(1)

                   A         B         C   D   F
2013-01-01       NaN       NaN       NaN NaN NaN
2013-01-02  1.223142  1.356687  1.701118   0 NaN
2013-01-03 -1.469671  0.722214 -0.369425   0   1
2013-01-04 -0.489524 -2.625106  1.762090   0   1
2013-01-05 -1.390067  0.606143 -3.072120   0   1
2013-01-06  2.926191  0.064181  2.743656   0   1

## Histogramming:

In [211]:
s = pd.Series(np.random.randint(0, 7, size=10))
s

0    4
1    1
2    5
3    5
4    2
5    3
6    3
7    1
8    0
9    5
dtype: int64

In [212]:
s.value_counts()

5    3
3    2
1    2
4    1
2    1
0    1
dtype: int64

In [216]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

## Merging:

In [217]:
df = pd.DataFrame(np.random.randn(10, 4))
df

          0         1         2         3
0 -0.580610  0.808324 -0.359821  0.216504
1  0.166798 -1.191449  0.040988  0.278795
2  1.309170 -0.022746  0.224254 -0.500722
3 -1.947586  1.050561 -0.090742 -1.141195
4 -1.911215 -1.963069  0.479118 -1.672461
5 -0.010941 -0.073971 -0.681051  0.108122
6 -0.681175  0.969521 -0.983631 -1.545256
7 -0.038140 -0.450054  0.200819 -1.391863
8  0.744500 -1.617943 -0.256488  1.036215
9  1.202540  0.860951 -0.442493  0.538132

In [227]:
pieces = [df[:3], df[3:7], df[7:]]
pieces

[          0         1         2         3
 0 -0.580610  0.808324 -0.359821  0.216504
 1  0.166798 -1.191449  0.040988  0.278795
 2  1.309170 -0.022746  0.224254 -0.500722,
           0         1         2         3
 3 -1.947586  1.050561 -0.090742 -1.141195
 4 -1.911215 -1.963069  0.479118 -1.672461
 5 -0.010941 -0.073971 -0.681051  0.108122
 6 -0.681175  0.969521 -0.983631 -1.545256,
          0         1         2         3
 7 -0.03814 -0.450054  0.200819 -1.391863
 8  0.74450 -1.617943 -0.256488  1.036215
 9  1.20254  0.860951 -0.442493  0.538132]

In [228]:
pd.concat(pieces)

          0         1         2         3
0 -0.580610  0.808324 -0.359821  0.216504
1  0.166798 -1.191449  0.040988  0.278795
2  1.309170 -0.022746  0.224254 -0.500722
3 -1.947586  1.050561 -0.090742 -1.141195
4 -1.911215 -1.963069  0.479118 -1.672461
5 -0.010941 -0.073971 -0.681051  0.108122
6 -0.681175  0.969521 -0.983631 -1.545256
7 -0.038140 -0.450054  0.200819 -1.391863
8  0.744500 -1.617943 -0.256488  1.036215
9  1.202540  0.860951 -0.442493  0.538132

## Join

In [237]:
left = pd.DataFrame({'key': ['foo', 'foo'], 'lval': [1, 2]})
right = pd.DataFrame({'key': ['foo', 'foo'], 'rval': [4, 5]})

In [238]:
left

   key  lval
0  foo     1
1  foo     2

In [239]:
right

   key  rval
0  foo     4
1  foo     5

In [240]:
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

## Append

In [242]:
df = pd.DataFrame(np.random.randn(8, 4), columns=['A', 'B', 'C', 'D'])
df

          A         B         C         D
0  0.103471 -0.968285  1.022797  1.218930
1  0.963265  0.607783 -0.967595 -0.239964
2 -0.184465 -1.159904  0.502168  0.815787
3  0.181637  0.247877  0.185097  0.940421
4  0.011755  0.037493 -1.392625 -0.323715
5  0.452295  0.673470 -0.194466  0.646776
6 -0.085748  0.743251 -1.888735 -1.174963
7 -0.863960 -1.975902  0.126548 -0.593281

In [257]:
s = df.iloc[3]
s

A    0.181637
B    0.247877
C    0.185097
D    0.940421
Name: 3, dtype: float64

In [258]:
df.append(s, ignore_index=True)

          A         B         C         D
0  0.103471 -0.968285  1.022797  1.218930
1  0.963265  0.607783 -0.967595 -0.239964
2 -0.184465 -1.159904  0.502168  0.815787
3  0.181637  0.247877  0.185097  0.940421
4  0.011755  0.037493 -1.392625 -0.323715
5  0.452295  0.673470 -0.194466  0.646776
6 -0.085748  0.743251 -1.888735 -1.174963
7 -0.863960 -1.975902  0.126548 -0.593281
8  0.181637  0.247877  0.185097  0.940421

## Grouping

In [261]:
df = pd.DataFrame({'A': ['foo', 'bar', 'foo', 'bar', 'foo', 'bar', 'foo', 'foo'],
                   'B': ['one', 'one', 'two', 'three', 'two', 'two', 'one', 'three'],
                   'C': np.random.randn(8),
                   'D': np.random.randn(8)})
df

     A      B         C         D
0  foo    one -2.493227  0.450198
1  bar    one -0.432361 -0.547276
2  foo    two -0.048365 -1.854674
3  bar  three -0.683287 -0.091493
4  foo    two  0.545678  0.723604
5  bar    two  0.051753 -0.009371
6  foo    one -0.572678 -0.899387
7  foo  three  0.395753  0.012335

In [267]:
df.groupby('A').sum()

            C         D
A
bar -1.063895 -0.648140
foo -2.172840 -1.567924

In [271]:
group_sum = df.groupby(['A', 'B']).sum()
group_sum

                  C         D
A   B
bar one   -0.432361 -0.547276
    three -0.683287 -0.091493
    two    0.051753 -0.009371
foo one   -3.065906 -0.449189
    three  0.395753  0.012335
    two    0.497313 -1.131070

In [272]:
type(group_sum)

pandas.core.frame.DataFrame

In [273]:
group_sum.index

MultiIndex(levels=[['bar', 'foo'], ['one', 'three', 'two']],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]],
           names=['A', 'B'])

## Reshaping